{
  "backend/main.mo": "Defines a simple booking actor storing bookings in a List and exposes a createBooking function that generates and saves a booking with timestamp.",
  "feature_evidence.json": "Feature evidence report describing an update to fleet data to use the Toyota Coaster Saloon 4C entry and image.",
  "frontend-file-summaries.txt": "Lists prewritten summaries for all frontend files, describing their roles in layout, data, components, and hooks.",
  "frontend/index.css": "Tailwind base layers and OKLCH variable definitions for light/dark themes with global background and text styling.",
  "frontend/index.html": "HTML entry point with SEO metadata, font imports, and root mount for the React app.",
  "frontend/src/App.tsx": "Main app component wiring top navigation, sections, footer, and booking scroll behavior with selectedCar state.",
  "frontend/src/components/FleetCarCard.tsx": "Card component displaying vehicle details and an action button invoking onBookNow.",
  "frontend/src/components/Footer.tsx": "Footer with company info, links, contact details, and caffeine.ai attribution link.",
  "frontend/src/components/sections/ContactBookingSection.tsx": "Contact and booking form section with validation, car pre-selection, and submission via createBooking hook.",
  "frontend/src/components/sections/FleetSection.tsx": "Displays fleet categories and vehicles using FleetCarCard with filtering by type and booking callback support.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders the landing hero with background image, headings, description, and buttons that scroll to the booking section.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Shows a grid of benefit cards highlighting features of the rental service.",
  "frontend/src/components/TopNav.tsx": "Sticky responsive navigation bar with scroll detection, smooth-scroll links, and mobile menu.",
  "frontend/src/data/fleet.ts": "Defines the Vehicle interface and exports categorized fleet data including luxury, executive, economy, and group vehicles.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating queries when identity changes.",
  "frontend/src/hooks/useCreateBooking.ts": "Provides a mutation to create a booking via the actor using adapted parameters and refreshes booking queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, authentication handling, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exposes a placeholder bookings query that awaits backend support.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for a luxury light/dark theme.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentity providers before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins for styling.",
  "project_state.json": "Stores the project’s build state, requirements, design notes, and features for the marketing website."
}